/* 
  Localizable.strings
  Kube-Solo

  Created by Brandon Evans on 2015-10-28.
  Copyright © 2015 Rimantas Mocevicius. All rights reserved.
*/

"AppName" = "Kube-Solo";
"OK" = "OK";
"Cancel" = "Cancel";

// VM States

"VMStateAlreadyRunning" = "VM is already running !!!";
"VMStateAlreadyOff" = "VM is already Off !!!";
"VMStateWillStop" = "VM will be stopped";
"VMStateStopping" = "VM is stopping !!!";
"VMStateOff" = "VM is OFF !!!";
"VMStateWillReload" = "VM will be reloaded";
"VMStateStopped" = "VM is stopped";
"VMStateRunning" = "VM is running";
"VMStateWillDestroy" = "VM will be destroyed";

// Notification Messages

"ClientsWillBeUpdatedNotificationMessage" = "macOS clients will be updated";
"ISOImageWillBeUpdatedNotificationMessage" = "CoreOS ISO image will be updated";
"ReleaseChannelChangeNotificationMessage" = "CoreOS release channel change";
"VMRAMChangeNotificationMessage" = "VM RAM size change";
"SSHShellWillOpenNotificationMessage" = "VM ssh shell will be opened";
"ShellWillOpenNotificationMessage" = "macOS shell will be opened";
"ConsoleWillOpenNotificationMessage" = "VM's console will be opened";
"WillSetupNotificationTitle" = "Kube Solo will be up shortly";
"WillSetupNotificationMessage" = "and OS shell will be opened";
"KubernetesUpdateNotificationTitle" = "Kube-Solo and";
"KubernetedUpdateNotificationMessage" = "macOS kubectl will be updated";
"KubernetesVersionChangeNotificationMessage" = "macOS kubectl version will be changed";
"QuittingNotificationTitle" = "Quitting Kube-Solo App";

// Alerts

"NotSetupAlertMessage" = "Kube Solo was not setup";
"NotSetupAlertInformativeText" = "Do you want to set it up?";
"SetupAlertMessage" = "You can set Kube-Solo from menu 'Setup':";
"SetupAlertInformativeText" = " 'Initial setup of Kube-Solo' at any time later one !!! ";
"HomeFolderExistsAlertInformativeText" = "Folder %@ exists, please delete or rename that folder !!!";
"AboutAlertMessage" = "Kube-Solo for macOS v%@";
"AboutInformativeText" = "It is a simple wrapper around corectl + CoreOS VM, which allows to control Kube-Solo via Status Bar !!!";
"DmgAlertMessage" = "Kube Solo App cannot be started from DMG !!!";
"DmgAlertInformativeText" = "Please copy the App to your /Applications folder ...";
"CorectlAppAlertMessage" = "Kube Solo App cannot start !!!";
"CorectlAppAlertInformativeText" = "corectl.app cannot be found in /Applications folder, the download link will be opened in your browser ...";
"UpAppAlertMessage" = "Cannot start VM !!!";
"AppUpdateMessage" = "There is a new Kube-Solo App version available !!!";
"AppUpdatenformativeText" = "The download link will be opened in your browser ...";
"NoAppUpdateMessage" = "Kube-Solo for macOS";
"NoAppUpdatenformativeText" = "You are-up-to-date !!!";

// URL

"AppReleaseURL" = "https://github.com/TheNewNormal/kube-solo-osx/releases";

